Catalogs/БанкротствоЗначенияСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>БанкротствоЗначенияСвойств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БанкротствоИерархияСвойств</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсходноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БанкротствоИерархияСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>БанкротствоИерархияСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсходноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПутьКДанным</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньИерархии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БанкротствоЗначенияСвойств/Ext/ManagerModule.bsl
Процедура ЗагрузитьИзМакетаЭлемены() Экспорт
	ТабДок = ПолучитьМакет("МакетБЗС");	
	ПЗ = Новый ПостроительЗапроса;	
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());	
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;	
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();	
	ТЗ = ПЗ.Результат.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Наименование КАК Наименование,
		|	ТЗ.ИсходноеНаименование КАК ИсходноеНаименование,
		|	ТЗ.ВладелецПолныйПутьКДанным КАК ВладелецПолныйПутьКДанным
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЗ.Наименование КАК ТЗНаименование,
		|	ВТ_ТЗ.ИсходноеНаименование КАК ТЗИсходноеНаименование,
		|	ВТ_ТЗ.ВладелецПолныйПутьКДанным КАК ТЗВладелецПолныйПутьКДанным,
		|	БанкротствоЗначенияСвойств.Ссылка КАК СпрСсылка,
		|	БанкротствоЗначенияСвойств.Наименование КАК СпрНаименование
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанкротствоЗначенияСвойств КАК БанкротствоЗначенияСвойств
		|		ПО ВТ_ТЗ.ВладелецПолныйПутьКДанным = БанкротствоЗначенияСвойств.Владелец.ПолныйПутьКДанным
		|			И ВТ_ТЗ.ИсходноеНаименование = БанкротствоЗначенияСвойств.ИсходноеНаименование
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТЗ.Наименование,
		|	ВТ_ТЗ.ИсходноеНаименование,
		|	БанкротствоЗначенияСвойств.Ссылка,
		|	БанкротствоЗначенияСвойств.Наименование,
		|	ВТ_ТЗ.ВладелецПолныйПутьКДанным";
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СпрСсылка) И Выборка.ТЗНаименование <> Выборка.СпрНаименование Тогда
			Спр = Выборка.СпрСсылка.ПолучитьОбъект();
			Спр.Наименование = Выборка.ТЗНаименование;
			Спр.Записать(); 
		ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.СпрСсылка) Тогда
			Спр = Справочники.БанкротствоЗначенияСвойств.СоздатьЭлемент();
			Спр.Наименование = Выборка.ТЗНаименование;
			Спр.ИсходноеНаименование = Выборка.ТЗИсходноеНаименование;
			Спр.Владелец = Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным",Выборка.ТЗВладелецПолныйПутьКДанным);	
			Спр.Записать();
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры // ЗагрузитьИзМакетаЭлемены()
